app/controllers/activities_controller.rb

SELECT "main_activities".* FROM "main_activities" WHERE "main_activities"."id" = 1 LIMIT 1
SELECT "activities".* FROM "activities"
---
  def index
    @main_activity = MainActivity.find(params[:main_activity_id])
    @activities = Activity.all

SELECT "main_activities".* FROM "main_activities" WHERE "main_activities"."id" = 1 LIMIT 1
---
  def new
    @main_activity = MainActivity.find(params[:main_activity_id])

SELECT "main_activities".* FROM "main_activities" WHERE "main_activities"."id" = 1 LIMIT 1
INSERT INTO "activities" ("main_activity_id", "average_id", "description", "updated_at", "created_at", "time_activity", "machine_id") VALUES (1, NULL, 'This is a little activity.', '2011-05-18 03:01:55.356165', '2011-05-18 03:01:55.356165', 5.0, NULL)
---
  def create
    @main_activity = MainActivity.find(params[:main_activity_id])
    @activity = @main_activity.activities.new(params[:activity])
    if @activity.save