app/controllers/main_activities_controller.rb

SELECT "main_activities".* FROM "main_activities"
---
  def index
    @main_activities = MainActivity.all

SELECT "main_activities".* FROM "main_activities" WHERE "main_activities"."id" = 1 LIMIT 1
---
  def show
    @main_activity = MainActivity.find(params[:id])

INSERT INTO "main_activities" ("description", "time_main_activity", "activity_id", "created_at", "updated_at", "assigned_main_activity_id") VALUES ('Primera actividad', 0.7, NULL, '2011-04-23 18:18:57.737037', '2011-04-23 18:18:57.737037', NULL)
---
  def create
    @main_activity = MainActivity.new(params[:main_activity])
    if @main_activity.save

SELECT "main_activities".* FROM "main_activities" WHERE "main_activities"."id" = 1 LIMIT 1
---
  def edit
    @main_activity = MainActivity.find(params[:id])

SELECT "main_activities".* FROM "main_activities" WHERE "main_activities"."id" = 1 LIMIT 1
UPDATE "main_activities" SET "updated_at" = '2011-05-18 03:17:12.531354', "description" = 'Make something.............more information about the process' WHERE "main_activities"."id" = 1
---
  def update
    @main_activity = MainActivity.find(params[:id])
    if @main_activity.update_attributes(params[:main_activity])