app/controllers/users_controller.rb

SELECT "vmodules".* FROM "vmodules" WHERE "vmodules"."id" = 1 LIMIT 1
SELECT "users".* FROM "users"
---
  def index
    @vmodule = Vmodule.find(params[:vmodule_id])
    @users = User.all

SELECT "vmodules".* FROM "vmodules" WHERE "vmodules"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 AND ("users".vmodule_id = 1) LIMIT 1
---
  def show
    @vmodule = Vmodule.find(params[:vmodule_id])
    @user = @vmodule.users.find(params[:id])

SELECT "vmodules".* FROM "vmodules" WHERE "vmodules"."id" = 1 LIMIT 1
---
  def new
    @vmodule = Vmodule.find(params[:vmodule_id])

SELECT "vmodules".* FROM "vmodules" WHERE "vmodules"."id" = 1 LIMIT 1
INSERT INTO "users" ("persistence_token", "password_salt", "email", "age", "vmodule_id", "username", "created_at", "average_id", "user_efficiency", "updated_at", "crypted_password") VALUES ('bbf8bafd9ecad989b93dcfcb396a6050e0064218c3ed3167ec3d7c7e2e3b583e2af9c1552b22aa061a90b00c7d3d43169197f529eda88fc4cb2af4b4975349cb', 'siRzUU9lZm6bwA2fFAzE', 'carm@ccc.com', 43, 3, 'camilo', '2011-05-18 02:01:54.724330', NULL, 0.9, '2011-05-18 02:01:54.724330', 'bf715dbdb07f45108ca398f8c3a216f16aec62dc559e6daf959ee93f1bd01296b94fe563768d2e95fb5a9ce8677d6e6f1e5059f914e040bcdc128d928c3e2dde')
---
  def create
    @vmodule = Vmodule.find(params[:vmodule_id])
    @user = @vmodule.users.new(params[:user])
    if @user.save

SELECT "vmodules".* FROM "vmodules" WHERE "vmodules"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 AND ("users".vmodule_id = 1) LIMIT 1
---
  def edit
    @vmodule = Vmodule.find(params[:vmodule_id])
    @user = @vmodule.users.find(params[:id])

SELECT "vmodules".* FROM "vmodules" WHERE "vmodules"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 AND ("users".vmodule_id = 1) LIMIT 1
UPDATE "users" SET "password_salt" = 'C7AIByP8u-i7B81N9IL_', "crypted_password" = '59ee1a37a8ea3efc6812a81b7d9c3f583764d1f572ec9e51589eeffbad4427edd73c0e250d4384088d45ead253c2f04d80a6336723b734d47a1d135c9fc1d4e7', "persistence_token" = '7be7c46f6b4058429e46218fd2e51e2666de51096d36e9895346f402221a923da2e51588c27a68e6c53bf654e6f76ce6243fdf439bd218ebcbce78fc3d42158c', "updated_at" = '2011-04-23 05:37:41.680764' WHERE "users"."id" = 1
---
  def update
    @vmodule = Vmodule.find(params[:vmodule_id])
    @user = @vmodule.users.find(params[:id])
    if @user.update_attributes(params[:user])