app/controllers/vmodules_controller.rb

SELECT "vmodules".* FROM "vmodules"
---
  def index
    @vmodules = Vmodule.all

SELECT "vmodules".* FROM "vmodules" WHERE "vmodules"."id" = 1 LIMIT 1
---
  def show
    @vmodule = Vmodule.find(params[:id])

INSERT INTO "vmodules" ("vmodule_number", "created_at", "updated_at", "vmodule_efficiency", "user_id") VALUES (2, '2011-05-18 01:32:16.232592', '2011-05-18 01:32:16.232592', 0.4, NULL)
---
  def create
    @vmodule = Vmodule.new(params[:vmodule])
    if @vmodule.save

SELECT "vmodules".* FROM "vmodules" WHERE "vmodules"."id" = 1 LIMIT 1
---
  def edit
    @vmodule = Vmodule.find(params[:id])

SELECT "vmodules".* FROM "vmodules" WHERE "vmodules"."id" = 1 LIMIT 1
UPDATE "vmodules" SET "vmodule_efficiency" = 1.24, "updated_at" = '2011-06-21 18:37:48.592071' WHERE "vmodules"."id" = 1
---
  def update
    @vmodule = Vmodule.find(params[:id])
    if @vmodule.update_attributes(params[:vmodule])

SELECT "vmodules".* FROM "vmodules" WHERE "vmodules"."id" = 1 LIMIT 1
---
  def update_span
    @vmodule = Vmodule.find(params[:id])

SELECT "vmodules".* FROM "vmodules" WHERE "vmodules"."id" = 1 LIMIT 1
---
  def update_worker
    @vmodule = Vmodule.find(params[:id])